GopalSaraf/Practicals/PSDL/include/proc/pic16f15255.inc
// Register: RB6I2C
#define RB6I2C RB6I2C
RB6I2C                                   equ 010Dh
// bitfield definitions
RB6I2C_TH_POSN                           equ 0000h
RB6I2C_TH_POSITION                       equ 0000h
RB6I2C_TH_SIZE                           equ 0002h
RB6I2C_TH_LENGTH                         equ 0002h
RB6I2C_TH_MASK                           equ 0003h
RB6I2C_PU_POSN                           equ 0004h
RB6I2C_PU_POSITION                       equ 0004h
RB6I2C_PU_SIZE                           equ 0002h
RB6I2C_PU_LENGTH                         equ 0002h
RB6I2C_PU_MASK                           equ 0030h
RB6I2C_SLEW_POSN                         equ 0006h
RB6I2C_SLEW_POSITION                     equ 0006h
RB6I2C_SLEW_SIZE                         equ 0001h
RB6I2C_SLEW_LENGTH                       equ 0001h
RB6I2C_SLEW_MASK                         equ 0040h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 010Eh
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0001h
RC3I2C_SLEW_LENGTH                       equ 0001h
RC3I2C_SLEW_MASK                         equ 0040h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 010Fh
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0001h
RC4I2C_SLEW_LENGTH                       equ 0001h
RC4I2C_SLEW_MASK                         equ 0040h

// Register: RC1REG
#define RC1REG RC1REG
RC1REG                                   equ 0119h
// bitfield definitions
RC1REG_RCREG_POSN                        equ 0000h
RC1REG_RCREG_POSITION                    equ 0000h
RC1REG_RCREG_SIZE                        equ 0008h
RC1REG_RCREG_LENGTH                      equ 0008h
RC1REG_RCREG_MASK                        equ 00FFh

// Register: TX1REG
#define TX1REG TX1REG
TX1REG                                   equ 011Ah
// bitfield definitions
TX1REG_TXREG_POSN                        equ 0000h
TX1REG_TXREG_POSITION                    equ 0000h
TX1REG_TXREG_SIZE                        equ 0008h
TX1REG_TXREG_LENGTH                      equ 0008h
TX1REG_TXREG_MASK                        equ 00FFh

// Register: SP1BRGL
#define SP1BRGL SP1BRGL
SP1BRGL                                  equ 011Bh
// bitfield definitions
SP1BRGL_SPBRGL_POSN                      equ 0000h
SP1BRGL_SPBRGL_POSITION                  equ 0000h
SP1BRGL_SPBRGL_SIZE                      equ 0008h
SP1BRGL_SPBRGL_LENGTH                    equ 0008h
SP1BRGL_SPBRGL_MASK                      equ 00FFh

// Register: SP1BRGH
#define SP1BRGH SP1BRGH
SP1BRGH                                  equ 011Ch
// bitfield definitions
SP1BRGH_SPBRGH_POSN                      equ 0000h
SP1BRGH_SPBRGH_POSITION                  equ 0000h
SP1BRGH_SPBRGH_SIZE                      equ 0008h
SP1BRGH_SPBRGH_LENGTH                    equ 0008h
SP1BRGH_SPBRGH_MASK                      equ 00FFh

// Register: RC1STA
#define RC1STA RC1STA
RC1STA                                   equ 011Dh
// bitfield definitions
RC1STA_RX9D_POSN                         equ 0000h
RC1STA_RX9D_POSITION                     equ 0000h
RC1STA_RX9D_SIZE                         equ 0001h
RC1STA_RX9D_LENGTH                       equ 0001h
RC1STA_RX9D_MASK                         equ 0001h
RC1STA_OERR_POSN                         equ 0001h
RC1STA_OERR_POSITION                     equ 0001h
RC1STA_OERR_SIZE                         equ 0001h
RC1STA_OERR_LENGTH                       equ 0001h
RC1STA_OERR_MASK                         equ 0002h
RC1STA_FERR_POSN                         equ 0002h
RC1STA_FERR_POSITION                     equ 0002h
RC1STA_FERR_SIZE                         equ 0001h
RC1STA_FERR_LENGTH                       equ 0001h
RC1STA_FERR_MASK                         equ 0004h
RC1STA_ADDEN_POSN                        equ 0003h
RC1STA_ADDEN_POSITION                    equ 0003h
RC1STA_ADDEN_SIZE                        equ 0001h
RC1STA_ADDEN_LENGTH                      equ 0001h
RC1STA_ADDEN_MASK                        equ 0008h
RC1STA_CREN_POSN                         equ 0004h
RC1STA_CREN_POSITION                     equ 0004h
RC1STA_CREN_SIZE                         equ 0001h
RC1STA_CREN_LENGTH                       equ 0001h
RC1STA_CREN_MASK                         equ 0010h
RC1STA_SREN_POSN                         equ 0005h
RC1STA_SREN_POSITION                     equ 0005h
RC1STA_SREN_SIZE                         equ 0001h
RC1STA_SREN_LENGTH                       equ 0001h
RC1STA_SREN_MASK                         equ 0020h
RC1STA_RX9_POSN                          equ 0006h
RC1STA_RX9_POSITION                      equ 0006h
RC1STA_RX9_SIZE                          equ 0001h
RC1STA_RX9_LENGTH                        equ 0001h
RC1STA_RX9_MASK                          equ 0040h
RC1STA_SPEN_POSN                         equ 0007h
RC1STA_SPEN_POSITION                     equ 0007h
RC1STA_SPEN_SIZE                         equ 0001h
RC1STA_SPEN_LENGTH                       equ 0001h
RC1STA_SPEN_MASK                         equ 0080h

